/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Operația nu a putut fi efectuată";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "A survenit o eroare necunoscută (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Acțiunea nu se poate efectua";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Reîncercați mai târziu.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Nu se poate înregistra";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Încercați să înregistrați din nou.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Nu se poate înregistra";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Opriți orice alte acțiuni care utilizează %@ și reîncercați."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Nu se poate înregistra";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Încercați să înregistrați din nou.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Încercați să înregistrați din nou.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Nu există suficient spațiu disponibil pentru a continua scrierea fișierului. Creați spațiu prin ștergerea de videoclipuri sau poze existente.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Încercați să înregistrați din nou.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Încercați să înregistrați din nou.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Înregistrarea a atins lungimea maximă autorizată."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Înregistrarea a atins dimensiunea de fișier maximă autorizată."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Opriți orice alte acțiuni care utilizează dispozitivul de înregistrare și reîncercați.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Înregistrarea a atins lungimea maximă autorizată."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Nu se poate înregistra";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Încercați să înregistrați din nou.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Nu se poate utiliza %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Opriți orice alte acțiuni care utilizează %@ și reîncercați."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Nu se poate utiliza %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Opriți orice alte acțiuni care utilizează %@ și reîncercați."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Înregistrarea s-a oprit";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Opriți orice alte acțiuni care utilizează dispozitivul de înregistrare și reîncercați.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Reflectorul nu a putut fi dezactivat.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Încercați să reglați reflectorul la un nivel mai scăzut.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Acțiunea nu se poate efectua";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Reîncercați mai târziu.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Exportarea nu se poate efectua";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Încercați să exportați din nou.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Imposibil de decodat";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Datele multimedia nu au putut fi decodate. Este posibil să fie deteriorate.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Acest format multimedia nu este admis.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Nu se poate salva";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Încercați să salvați din nou.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Nu se poate scrie fișierul de ieșire";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Schimbați extensia de ieșire și reîncercați.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Acest conținut multimedia nu poate fi utilizat.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Acest conținut multimedia nu poate fi utilizat.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Acest conținut multimedia nu poate fi utilizat.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Acest conținut multimedia nu poate fi utilizat.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Acest format multimedia nu este admis.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Acest conținut multimedia poate fi deteriorat.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Nu se poate fotografia";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Încercați să fotografiați din nou.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Operația nu este admisă pentru conținutul protejat."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Acest conținut nu este autorizat."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Această aplicație nu este autorizată pentru a reda acest fișier."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Acest conținut multimedia nu poate fi utilizat.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Imposibil de decodat";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Decodorul necesar pentru acest conținut multimedia nu poate fi găsit.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Imposibil de codat";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Codorul necesar pentru acest conținut multimedia nu poate fi găsit.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Imposibil de decodat";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Decodorul necesar pentru acest conținut multimedia este ocupat.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Opriți orice alte acțiuni care decodifică conținut multimedia și reîncercați.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Imposibil de codat";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Codorul necesar pentru acest conținut multimedia este ocupat.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Opriți orice alte acțiuni care codifică conținut multimedia și reîncercați.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Nu se poate utiliza %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "O aplicație rulând în fundal nu poate utiliza %@."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Operația nu este admisă pentru acest conținut multimedia.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Videoclipul nu a putut fi compus în conformitate cu instrucțiunile furnizate.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Acest conținut multimedia nu poate fi utilizat.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Fișierul de memorie tampon de la URL-ul de destinație al descărcării nu poate fi utilizat.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Fișierul are o sumă de control nevalidă.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Operație întreruptă";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Opriți celelate operații și reîncercați.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Nu se poate deschide";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Conținutul multimedia nu poate fi utilizat pe acest dispozitiv.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Acest conținut multimedia poate fi deteriorat.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Operație oprită";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Serverul nu este configurat corect.";
